// MIT License
//
// Copyright (c) 2025 Maksim Kochemasov
//
// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE. 

#Область ПрограммныйИнтерфейс

#Область ДанныеАутентификации

// Обработчик записи данных аутентификации внешнего сервиса в хранилище.
// В данном обработчике необходимо реализовать алгоримт записи данных аутентификации
// в соответствующее хранилище. Хранилищем может выступать как таблица текущей информационной базы
// так и любая другая внешняя система хранения. При наличии БСП можно использовать запись
// в безопасное хранилище (см. пример)
//
// Параметры:
//  ИдентификаторАутентификации - Строка - уникальный идентификатор, по которому 
//                                         можно получить данные аутентификации внешнего сервиса
//
//  ДанныеАутентификации - Соответствие - данные аутентификации к внешнему сервису
//
// Пример:
//
//    КлючДанныхАутентификацииВХранилище = "LogPass";
//
//    УстановитьПривилегированныйРежим(Истина);
//    
//    ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ИдентификаторАутентификации, ДанныеАутентификации,
//        КлючДанныхАутентификацииВХранилище);
//
//    УстановитьПривилегированныйРежим(Ложь);
//
Процедура ПриЗаписиДанныхАутентификацийВХранилище(ИдентификаторАутентификации, ДанныеАутентификации) Экспорт
	
КонецПроцедуры

// Обработчик получения данных аутентификации внешнего сервиса из хранилища.
// В данном обработчике необходимо реализовать алгоритм получения данных аутентификации
// внешнего сервиса из соответствующего хранилища по переданному идентфикатору аутентификации.
// При наличии БСП можно использовать механизм безопасного хранилища (если запись так же выполняется
// в безопасное хранилище. См. пример записи в ПриЗаписиДанныхАутентификацийВХранилище)
//
// Параметры:
//  ИдентификаторАутентификации - Строка - идентификатор данных аутентификации внешнего сервиса в хранилище,
//                                         по которому нужно получить данные аутентификации
//
//  ДанныеАутентификации - Соответствие - выходной параметр. Данные аутентификации внешнего сервиса,
//                                        найденные по переданному идентификатору
//
// Пример:
//
//    КлючДанныхАутентификацииВХранилище = "LogPass";
//
//    УстановитьПривилегированныйРежим(Истина);
//    
//    ДанныеАутентификации = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ИдентификаторАутентификации,
//        КлючДанныхАутентификацииВХранилище);
//    
//    УстановитьПривилегированныйРежим(Ложь);
//
Процедура ПриПолученииДанныхАутентификацииИзХранилища(ИдентификаторАутентификации, ДанныеАутентификации) Экспорт
	
КонецПроцедуры

// Обработчик удаления данных аутентификаций внешнего сервиса из хранилища.
// Вызывается при удалении ссылки на внешний сервис из информационной базы
// (см. справочник тм_ВнешниеСервисы)
// В данном обработчике необходимо реализовать алгоритм удаления данных аутентификаций
// внешнего сервиса с указанным идентификатором аутентификации. При использовании БСП
// можно воспользоваться механизмом безопасного хранилища (если данные аутентификации
// были записаны с помощью этого механизма. См. пример в ПриЗаписиДанныхАутентификацийВХранилище)
//
// Параметры:
//  ИдентификаторАутентификации - Строка - уникальный идентификатор данных аутентификации внешнего сервиса
//                                         которые нужно удалить
//
// Пример:
//
//    УстановитьПривилегированныйРежим(Истина);
//
//    ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(ИдентификаторАутентификации);
//
//    УстановитьПривилегированныйРежим(Ложь);
//
Процедура ПриУдаленииДанныхАутентификацииИзХранилища(ИдентификаторАутентификации) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеОбработкиМодулейВнешнегоСервиса

// Обработчик создания объекта внешней обработки основного модуля внешнего сервиса
// и модулей прикладных операций. Обязателен для реализации. При использовании БСП
// и хранении обработок модуля API и прикладных операций в справочнике ДополнительныеОтчетыИОбработки
// можно воспользоваться соответствующим функционалом создания объекта внешней обработки (см. пример)
//
// Параметры:
//  ЭлементХраненияОбработки - ОпределяемыйТип.тм_МодульАпи - ссылка на элемент хранения внешней обработки
//                                                            модуля API и прикладных операций
//
//  ОбработкаМодуля - ВнешняяОбработкаОбъект - выходной параметр. В данный параметр необходимо передать объект внешней обработки
//                                             модуля API или прикладной операции, которая хранится в ЭлементХраненияОбработки
//
// Пример:
// 
//     ОбработкаМодуля = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ЭлементХраненияОбработки)
//
Процедура ПриПолученииВнешнейОбработкиМодуляВнешнегоСервиса(ЭлементХраненияОбработки, ОбработкаМодуля) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
